pybricks/pybricks-micropython/lib/pbio/drv/bluetooth/bluetooth_stm32_bluenrg.c
    // SPI2

    // set as master and clock /8
    #define SPI_CR1_BR_DIV8 SPI_CR1_BR_1
    SPI2->CR1 = SPI_CR1_MSTR | SPI_CR1_BR_DIV8 | SPI_CR1_SSM;
    // enable DMA rx/tx, chip select (even though it is unused?), rx not empty irq, 8-bit word size, trigger rx irq on 8-bit
    #define SPI_CR2_DS_8BIT (SPI_CR2_DS_0 | SPI_CR2_DS_1 | SPI_CR2_DS_2)
    SPI2->CR2 = SPI_CR2_RXDMAEN | SPI_CR2_TXDMAEN | SPI_CR2_SSOE | SPI_CR2_RXNEIE | SPI_CR2_DS_8BIT | SPI_CR2_FRXTH;

    // LEGO Firmware doesn't do this, but we actually use IRQ for SPI_IRQ pin
    // this is needed since we use __WFI() sometimes
    SYSCFG->EXTICR[0] |= SYSCFG_EXTICR1_EXTI2_PD;
    EXTI->IMR |= EXTI_EMR_MR2;
    EXTI->RTSR |= EXTI_RTSR_RT2;
    EXTI->FTSR |= EXTI_FTSR_FT2;
    NVIC_SetPriority(EXTI2_3_IRQn, 3);
    NVIC_EnableIRQ(EXTI2_3_IRQn);
}

const char *pbdrv_bluetooth_get_hub_name(void) {
    return pbdrv_bluetooth_hub_name;
}

const char *pbdrv_bluetooth_get_fw_version(void) {
    return pbdrv_bluetooth_fw_version;
}

// Many HCI commands in this driver have parameters that are all fixed at
// compile time. Storing the complete command as const data takes considerably
// less flash than packing the parameters at runtime with the aci_*_begin
// functions.
typedef struct {
    uint16_t opcode;
    uint8_t plen;
    uint8_t params[];
} hci_const_cmd_t;

static void hci_send_const_cmd(const hci_const_cmd_t *cmd) {
    struct hci_request rq = {
        .opcode = cmd->opcode,
        .cparam = (void *)cmd->params,
        .clen = cmd->plen,
    };
    hci_send_req(&rq);
}

// State for hci_cmd_thread(). A single shared instance suffices because at
// most one HCI command exchange is in flight at a time, which is the same
// assumption the global hci_command_complete flag already makes.
static pbio_os_state_t hci_cmd_sub;

// Sends a command with constant parameters and waits for the completion flag
// to be set.
static pbio_error_t hci_cmd_thread(pbio_os_state_t *state, const hci_const_cmd_t *cmd, bool *flag) {
    PBIO_OS_ASYNC_BEGIN(state);

    hci_send_const_cmd(cmd);
    PBIO_OS_AWAIT_UNTIL(state, *flag);

    PBIO_OS_ASYNC_END(PBIO_SUCCESS);
}

// Sends a command with constant parameters and awaits the command complete
// (or, for the _STATUS variant, command status) event.
#define HCI_AWAIT_CONST_CMD(state, cmd) \
    PBIO_OS_AWAIT(state, &hci_cmd_sub, hci_cmd_thread(&hci_cmd_sub, cmd, &hci_command_complete))
#define HCI_AWAIT_CONST_CMD_STATUS(state, cmd) \
    PBIO_OS_AWAIT(state, &hci_cmd_sub, hci_cmd_thread(&hci_cmd_sub, cmd, &hci_command_status))

// Equivalent of aci_gap_set_discoverable_begin(ADV_IND, 0, 0,
// STATIC_RANDOM_ADDR, NO_WHITE_LIST_USE, 0, NULL, sizeof(service_uuids),
// service_uuids, 0, 0).
static const hci_const_cmd_t cmd_gap_set_discoverable = {
    .opcode = cmd_opcode_pack(OGF_VENDOR_CMD, OCF_GAP_SET_DISCOVERABLE),
    .plen = 30,
    .params = {
        ADV_IND,
        0x00, 0x00, // Adv_Interval_Min
        0x00, 0x00, // Adv_Interval_Max
        STATIC_RANDOM_ADDR,
        NO_WHITE_LIST_USE,
        0, // Local_Name_Length
        17, // Service_Uuid_Length
        // Pybricks service UUID: c5f50001-8280-46da-89f4-6d8051e4aeef
        AD_TYPE_128_BIT_SERV_UUID,
        0xef, 0xae, 0xe4, 0x51, 0x80, 0x6d, 0xf4, 0x89,
        0xda, 0x46, 0x80, 0x82, 0x01, 0x00, 0xf5, 0xc5,
        0x00, 0x00, // Slave_Conn_Interval_Min
        0x00, 0x00, // Slave_Conn_Interval_Max
    },
};

/**
 * Sets advertising data and enables advertisements.
 */
pbio_error_t pbdrv_bluetooth_start_advertising_func(pbio_os_state_t *state, void *context) {
    tBleStatus status;

    // Scan response data up to the hub name, which is appended at runtime.
    static const uint8_t response_data_template[] = {
        // Device Information Service (DIS) PnP ID as service data to identify the hub.
        1 + 2 + PBIO_PYBRICKS_PNP_ID_SIZE,
        AD_TYPE_SERVICE_DATA,
        PBIO_UINT16_LE(PBIO_GATT_PNP_ID_CHAR_UUID),
        PBIO_PYBRICKS_PNP_ID_INIT(PBDRV_CONFIG_HUB_KIND, PBDRV_CONFIG_HUB_VARIANT),
        0, // hub name length + 1, filled in at runtime
        AD_TYPE_COMPLETE_LOCAL_NAME,
    };

    PBIO_OS_ASYNC_BEGIN(state);

    // TODO: LEGO firmware also includes Conn_Interval_Min, Conn_Interval_Max.
    // Do we need these?
    uint8_t response_data[25];
    memcpy(response_data, response_data_template, sizeof(response_data_template));
    uint8_t hub_name_len = strlen(pbdrv_bluetooth_hub_name);
    response_data[11] = hub_name_len + 1;
    memcpy(&response_data[13], pbdrv_bluetooth_hub_name, hub_name_len);
    _Static_assert(sizeof(response_data_template) == 13, "hub name must follow the 13 byte template");
    _Static_assert(13 + sizeof(pbdrv_bluetooth_hub_name) - 1 <= 31, "scan response is 31 octet max");

    hci_le_set_scan_response_data_begin(13 + hub_name_len, response_data);
    PBIO_OS_AWAIT_UNTIL(state, hci_command_complete);
    // hci_le_set_scan_response_data_end();

    HCI_AWAIT_CONST_CMD(state, &cmd_gap_set_discoverable);
    status = aci_gap_set_discoverable_end();

    // Recording this as advertising when it is not means nothing ever tries
    // again, since starting is skipped when it is already in that state.
    if (status != BLE_STATUS_SUCCESS) {
        return ble_error_to_pbio_error(status);
    }

    pbdrv_bluetooth_advertising_state = PBDRV_BLUETOOTH_ADVERTISING_STATE_ADVERTISING_PYBRICKS;

    PBIO_OS_ASYNC_END(PBIO_SUCCESS);
}

// Equivalent of aci_gap_set_non_discoverable_begin().
static const hci_const_cmd_t cmd_gap_set_non_discoverable = {
    .opcode = cmd_opcode_pack(OGF_VENDOR_CMD, OCF_GAP_SET_NON_DISCOVERABLE),
    .plen = 0,
};

// Equivalent of hci_le_set_advertise_enable_begin(0).
static const hci_const_cmd_t cmd_le_set_advertise_disable = {
    .opcode = cmd_opcode_pack(OGF_LE_CTL, OCF_LE_SET_ADVERTISE_ENABLE),
    .plen = 1,
    .params = { 0 },
};

pbio_error_t pbdrv_bluetooth_stop_advertising_func(pbio_os_state_t *state, void *context) {
    PBIO_OS_ASYNC_BEGIN(state);

    // REVISIT: might need to delete advertising data here

    if (pbdrv_bluetooth_advertising_state == PBDRV_BLUETOOTH_ADVERTISING_STATE_BROADCASTING) {
        // The GAP layer does not know about advertising that was enabled with
        // a link layer command, so it has to be stopped the same way.
        HCI_AWAIT_CONST_CMD(state, &cmd_le_set_advertise_disable);
    } else {
        HCI_AWAIT_CONST_CMD(state, &cmd_gap_set_non_discoverable);
        // aci_gap_set_non_discoverable_end();
    }

    // This protothread is also shared with stop broadcasting. Either way,
    // nothing is advertising or broadcasting after this, so reset that state.
    // even if it wasn't active.
    pbdrv_bluetooth_advertising_state = PBDRV_BLUETOOTH_ADVERTISING_STATE_NONE;

