pybricks/pybricks-micropython/lib/pbio/drv/bluetooth/bluetooth_stm32_bluenrg.c
    PBIO_OS_ASYNC_END(PBIO_SUCCESS);
}

uint16_t pbdrv_bluetooth_get_max_message_size(void) {
    // Fixed MTU minus the 3-byte ATT notification header.
    return PBDRV_CONFIG_BLUETOOTH_MAX_MTU_SIZE - PBIO_BLUETOOTH_ATT_HEADER_SIZE;
}

pbio_error_t pbdrv_bluetooth_send_pybricks_value_notification(pbio_os_state_t *state, const uint8_t *data, uint16_t size) {

    PBIO_OS_ASYNC_BEGIN(state);

retry:
    aci_gatt_update_char_value_begin(pybricks_service_handle, pybricks_command_event_char_handle, 0, size, data);
    PBIO_OS_AWAIT_UNTIL(state, hci_command_complete);
    tBleStatus ret = aci_gatt_update_char_value_end();

    if (ret == BLE_STATUS_INSUFFICIENT_RESOURCES) {
        // this will happen if notifications are enabled and the previous
        // changes haven't been sent over the air yet
        tx_pool_available = false;
        PBIO_OS_AWAIT_UNTIL(state, tx_pool_available);
        goto retry;
    }

    PBIO_OS_ASYNC_END(PBIO_SUCCESS);
}

// Equivalent of aci_gap_start_general_conn_establish_proc_begin(scan_type,
// scan_interval, scan_window, STATIC_RANDOM_ADDR, 0).
#define GAP_START_GENERAL_CONN_ESTABLISH_PROC_CMD(name, scan_type, scan_interval, scan_window) \
    static const hci_const_cmd_t name = { \
        .opcode = cmd_opcode_pack(OGF_VENDOR_CMD, OCF_GAP_START_GENERAL_CONN_ESTABLISH_PROC), \
        .plen = 7, \
        .params = { \
            scan_type, \
            PBIO_UINT16_LE(scan_interval), \
            PBIO_UINT16_LE(scan_window), \
            STATIC_RANDOM_ADDR, \
            0, /* filter_duplicates */ \
        }, \
    }

GAP_START_GENERAL_CONN_ESTABLISH_PROC_CMD(cmd_gap_start_active_scan, ACTIVE_SCAN, 0x0030, 0x0030);

// 70ms interval, 35ms window. The 50% duty cycle leaves radio time for
// broadcasting while observing, and the longer interval spends less of the
// radio on starting and ending scans.
GAP_START_GENERAL_CONN_ESTABLISH_PROC_CMD(cmd_gap_start_passive_scan, PASSIVE_SCAN, 0x0070, 0x0038);

// Equivalent of aci_gap_terminate_gap_procedure_begin(procedure_code).
#define GAP_TERMINATE_GAP_PROCEDURE_CMD(name, procedure_code) \
    static const hci_const_cmd_t name = { \
        .opcode = cmd_opcode_pack(OGF_VENDOR_CMD, OCF_GAP_TERMINATE_GAP_PROCEDURE), \
        .plen = 1, \
        .params = { procedure_code }, \
    }

GAP_TERMINATE_GAP_PROCEDURE_CMD(cmd_gap_terminate_general_proc, GAP_GENERAL_CONNECTION_ESTABLISHMENT_PROC);
GAP_TERMINATE_GAP_PROCEDURE_CMD(cmd_gap_terminate_direct_proc, GAP_DIRECT_CONNECTION_ESTABLISHMENT_PROC);

pbio_error_t pbdrv_bluetooth_peripheral_scan_and_connect_func(pbio_os_state_t *state, void *context) {
    pbio_bluetooth_peripheral_t *peri = context;

    // Scan and connect timeout, if applicable.
    bool timed_out = peri->config.timeout && pbio_os_timer_is_expired(&peri->timer);

    // Operation can be explicitly cancelled or automatically on inactivity.
    if (!peri->cancel) {
        peri->cancel = pbio_os_timer_is_expired(&peri->watchdog);
    }

    PBIO_OS_ASYNC_BEGIN(state);

    // start scanning
    HCI_AWAIT_CONST_CMD_STATUS(state, &cmd_gap_start_active_scan);
    peri->status = aci_gap_start_general_conn_establish_proc_end();

try_again:

    for (;;) {
        advertising_data_received = false;
        PBIO_OS_AWAIT_UNTIL(state, advertising_data_received || peri->cancel || timed_out);

        if (!advertising_data_received) {
            goto stop_scanning_failed;
        }

        le_advertising_info *subevt = (void *)&read_buf[5];

        // If advertisement doesn't match context-specific filter, keep scanning.
        if (subevt->evt_type > PBIO_BLUETOOTH_AD_TYPE_ADV_DIRECT_IND || !peri->config.match_adv(peri->user, subevt->data_RSSI, subevt->data_length)) {
            continue;
        }

        // If the value matched but it's the same device as last time, we're
        // here because the scan response failed the last time. It probably
        // won't match now and we should try a different device.
        if (!memcmp(peri->bdaddr, subevt->bdaddr, sizeof(peri->bdaddr))) {
            goto try_again;
        }

        // save the Bluetooth address for later
        peri->bdaddr_type = subevt->bdaddr_type;
        memcpy(peri->bdaddr, subevt->bdaddr, sizeof(peri->bdaddr));
        // Copy data to allow virtual re-connect in a new user program.
        peri->config.match_adv_data_len = subevt->data_length;
        memcpy(peri->config.match_adv_data, subevt->data_RSSI, subevt->data_length);
        break;
    }

    for (;;) {
        advertising_data_received = false;
        PBIO_OS_AWAIT_UNTIL(state, advertising_data_received || peri->cancel || timed_out);

        if (!advertising_data_received) {
            goto stop_scanning_failed;
        }

        le_advertising_info *subevt = (void *)&read_buf[5];

        // We are looking for a scan response from the same device as before, else keep scanning for responses.
        if (subevt->evt_type != PBIO_BLUETOOTH_AD_TYPE_SCAN_RSP || memcmp(peri->bdaddr, subevt->bdaddr, sizeof(peri->bdaddr))) {
            continue;
        }

        // If the device checks passed but the name doesn't match, start over.
        if (!peri->config.match_adv_rsp(peri->user, subevt->data_RSSI, subevt->data_length)) {
            goto try_again;
        }

        // All checks passed, so copy the device name for later use.
        memcpy(peri->name, &subevt->data_RSSI[2], sizeof(peri->name));
        // Copy data to allow virtual re-connect in a new user program.
        peri->config.match_adv_rsp_data_len = subevt->data_length;
        memcpy(peri->config.match_adv_rsp_data, subevt->data_RSSI, subevt->data_length);
        break;
    }

    // stop scanning
    HCI_AWAIT_CONST_CMD(state, &cmd_gap_terminate_general_proc);
    peri->status = aci_gap_terminate_gap_procedure_end();

    // REVISIT: might need to wait for procedure complete event here

    // connect
    assert(!peri->con_handle);

    // The connection interval is the anchor period that the chip schedules
    // everything else around, and the last two parameters are how much of each
    // period this link reserves. Asking for up to 30ms out of a period that
    // could itself be 10ms left nothing to allocate an advertising event in,
    // so the hub could not be connected to while a remote was attached. Both
    // halves matter: a 30ms period is just as full if 30ms of it is reserved.
    aci_gap_create_connection_begin(0x0060, 0x0030, peri->bdaddr_type, peri->bdaddr,
        STATIC_RANDOM_ADDR, 0x0030 >> 1, 0x0030 >> 1, 4, 720 / 10, 0x0004, 0x0010);
    PBIO_OS_AWAIT_UNTIL(state, hci_command_status);
    peri->status = aci_gap_create_connection_end();

    // Await connection to be ready unless cancelled sooner.
    PBIO_OS_AWAIT_UNTIL(state, peri->cancel || timed_out || peri->con_handle);

    if (peri->cancel || timed_out) {
        HCI_AWAIT_CONST_CMD(state, &cmd_gap_terminate_direct_proc);
        // aci_gap_terminate_gap_procedure_end();
        return peri->cancel ? PBIO_ERROR_CANCELED : PBIO_ERROR_TIMEDOUT;
    }

    return ble_error_to_pbio_error(peri->status);

    // Scanning did not turn up a matching device in time, so stop scanning.
stop_scanning_failed:
    HCI_AWAIT_CONST_CMD(state, &cmd_gap_terminate_general_proc);
    // aci_gap_terminate_gap_procedure_end();
    return peri->cancel ? PBIO_ERROR_CANCELED : PBIO_ERROR_TIMEDOUT;

    // Unreachable.
    PBIO_OS_ASYNC_END(PBIO_ERROR_FAILED);
}

pbio_error_t pbdrv_bluetooth_peripheral_discover_characteristic_func(pbio_os_state_t *state, void *context) {
    pbio_bluetooth_peripheral_t *peri = context;

    PBIO_OS_ASYNC_BEGIN(state);

    uint8_t uuid_le[16];
    uint8_t uuid_type;
    if (peri->char_disc.uuid16) {
        pbio_set_uint16_le(uuid_le, peri->char_disc.uuid16);
        uuid_type = UUID_TYPE_16;
    } else {
        pbio_uuid128_reverse_copy(uuid_le, peri->char_disc.uuid128);
        uuid_type = UUID_TYPE_128;
    }
    uint16_t handle_max = /* peri->char_disc.handle_max ? peri->char_disc.handle_max : */ 0xffff; // Not implemented due to build size limitations.
    aci_gatt_disc_charac_by_uuid_begin(peri->con_handle, 0x0001, handle_max, uuid_type, uuid_le);
    PBIO_OS_AWAIT_UNTIL(state, hci_command_status);
    peri->status = aci_gatt_disc_charac_by_uuid_end();

    PBIO_OS_AWAIT_UNTIL(state, ({
        void *payload;
        uint16_t event;
        (payload = get_vendor_event(&event))
        && ({
            if (event == EVT_BLUE_GATT_DISC_READ_CHAR_BY_UUID_RESP) {
                evt_gatt_disc_read_char_by_uuid_resp *subevt = payload;
                // Filtering by properties is not implemented due to build size
                // limitations. This means it will find only one characteristic
                // even if there are multiple matches. There is no guarantee
                // which one it will find, but probably the last one.
                if (subevt->conn_handle == peri->con_handle) {
                    peri->char_disc.handle = subevt->attr_handle;
                }
            }
            event == EVT_BLUE_GATT_PROCEDURE_COMPLETE;
        }) && ({
            evt_gatt_procedure_complete *subevt = payload;
            subevt->conn_handle == peri->con_handle;
        });
    }));

    // If notifications are not requested, we're done.
    if (!peri->char_disc.request_notification) {
        return ble_error_to_pbio_error(peri->status);
    }

    static const uint16_t enable = 0x0001;

