pybricks/pybricks-micropython/lib/pbio/drv/bluetooth/bluetooth_stm32_bluenrg.c
retry:
    aci_gatt_write_charac_value_begin(peri->con_handle, peri->char_disc.handle + 2, sizeof(enable), (const uint8_t *)&enable);
    PBIO_OS_AWAIT_UNTIL(state, hci_command_status);
    peri->status = aci_gatt_write_charac_value_end();

    if (peri->status != BLE_STATUS_SUCCESS) {

        if (peri->status == BLE_STATUS_NOT_ALLOWED) {
            goto retry;
        }

        return ble_error_to_pbio_error(peri->status);
    }

    evt_gatt_procedure_complete *payload;
    PBIO_OS_AWAIT_UNTIL(state, ({
        uint16_t event;
        (payload = get_vendor_event(&event))
        && event == EVT_BLUE_GATT_PROCEDURE_COMPLETE
        && payload->conn_handle == peri->con_handle;
    }));

    peri->status = payload->error_code;

    PBIO_OS_ASYNC_END(ble_error_to_pbio_error(peri->status));
}


pbio_error_t pbdrv_bluetooth_peripheral_read_characteristic_func(pbio_os_state_t *state, void *context) {
    return PBIO_ERROR_NOT_IMPLEMENTED;
}

pbio_error_t pbdrv_bluetooth_peripheral_write_characteristic_func(pbio_os_state_t *state, void *context) {
    pbio_bluetooth_peripheral_t *peri = context;

    evt_gatt_procedure_complete *payload;

    PBIO_OS_ASYNC_BEGIN(state);

    aci_gatt_write_charac_value_begin(peri->con_handle, peri->char_handle + 1, peri->char_size, peri->char_data);
    PBIO_OS_AWAIT_UNTIL(state, hci_command_status);
    tBleStatus status = aci_gatt_write_charac_value_end();

    if (status != BLE_STATUS_SUCCESS) {
        return ble_error_to_pbio_error(status);
    }

    PBIO_OS_AWAIT_UNTIL(state, ({
        if (peri->con_handle == 0) {
            return PBIO_ERROR_NO_DEV;
        }

        uint16_t event;
        (payload = get_vendor_event(&event))
        && event == EVT_BLUE_GATT_PROCEDURE_COMPLETE
        && payload->conn_handle == peri->con_handle;
    }));

    PBIO_OS_ASYNC_END(ble_error_to_pbio_error(payload->error_code));
}

pbio_error_t pbdrv_bluetooth_peripheral_disconnect_func(pbio_os_state_t *state, void *context) {

    pbio_bluetooth_peripheral_t *peri = context;

    PBIO_OS_ASYNC_BEGIN(state);

    if (!pbdrv_bluetooth_peripheral_is_connected(peri)) {
        return PBIO_SUCCESS;
    }

    aci_gap_terminate_begin(peri->con_handle, HCI_OE_USER_ENDED_CONNECTION);
    PBIO_OS_AWAIT_UNTIL(state, hci_command_status);
    aci_gap_terminate_end();

    PBIO_OS_AWAIT_UNTIL(state, peri->con_handle == 0);

    PBIO_OS_ASYNC_END(PBIO_SUCCESS);
}


// Equivalent of hci_le_set_advertising_parameters_begin() with a
// non-connectable, undirected advertising type on all three channels.
static const hci_const_cmd_t cmd_le_set_adv_parameters = {
    .opcode = cmd_opcode_pack(OGF_LE_CTL, OCF_LE_SET_ADV_PARAMETERS),
    .plen = 15,
    .params = {
        // 100ms is the fastest this controller allows. The range has to be
        // wide, because the chip fits a new activity to the anchor period it
        // is already running for the connection and any scanning, and rejects
        // an interval that is not a multiple of it.
        PBIO_UINT16_LE(0x00a0), // Advertising_Interval_Min, 100ms
        PBIO_UINT16_LE(0x0140), // Advertising_Interval_Max, 200ms
        ADV_NONCONN_IND,
        STATIC_RANDOM_ADDR,
        0, // Peer_Address_Type
        0, 0, 0, 0, 0, 0, // Peer_Address
        0x07, // Advertising_Channel_Map
        NO_WHITE_LIST_USE,
    },
};

// Equivalent of hci_le_set_advertise_enable_begin(1).
static const hci_const_cmd_t cmd_le_set_advertise_enable = {
    .opcode = cmd_opcode_pack(OGF_LE_CTL, OCF_LE_SET_ADVERTISE_ENABLE),
    .plen = 1,
    .params = { 1 },
};

pbio_error_t pbdrv_bluetooth_start_broadcasting_func(pbio_os_state_t *state, void *context) {

    tBleStatus status;

    PBIO_OS_ASYNC_BEGIN(state);

    // The GAP layer refuses to enter any advertising mode while a computer is
    // connected, so the link layer is driven directly instead.
    if (pbdrv_bluetooth_advertising_state != PBDRV_BLUETOOTH_ADVERTISING_STATE_BROADCASTING) {

        // Advertising parameters can only be set while advertising is stopped,
        // which it always is here, since starting a program stops it.
        HCI_AWAIT_CONST_CMD(state, &cmd_le_set_adv_parameters);
        status = hci_le_command_end();

        if (status != BLE_STATUS_SUCCESS) {
            return ble_error_to_pbio_error(status);
        }
    }

    // The link layer advertises exactly this payload.
    hci_le_set_advertising_data_begin(pbdrv_bluetooth_broadcast_data_size, pbdrv_bluetooth_broadcast_data);
    PBIO_OS_AWAIT_UNTIL(state, hci_command_complete);
    status = hci_le_set_advertising_data_end();

    if (status != BLE_STATUS_SUCCESS) {
        return ble_error_to_pbio_error(status);
    }

    if (pbdrv_bluetooth_advertising_state == PBDRV_BLUETOOTH_ADVERTISING_STATE_BROADCASTING) {
        // Already advertising, so updating the data was all that was needed.
        return PBIO_SUCCESS;
    }

    HCI_AWAIT_CONST_CMD(state, &cmd_le_set_advertise_enable);
    status = hci_le_command_end();

    if (status == BLE_STATUS_SUCCESS) {
        pbdrv_bluetooth_advertising_state = PBDRV_BLUETOOTH_ADVERTISING_STATE_BROADCASTING;
    }

    PBIO_OS_ASYNC_END(ble_error_to_pbio_error(status));
}

pbio_error_t pbdrv_bluetooth_start_observing_func(pbio_os_state_t *state, void *context) {

    tBleStatus status;

    PBIO_OS_ASYNC_BEGIN(state);

    // NB: we should probably be using aci_gap_start_observation_procedure_begin
    // here, but we already use aci_gap_start_general_conn_establish_proc_begin
    // elsewhere, so this reduces code size and we would also have to enable
    // the observer role which would use more RAM in the Bluetooth chip

    HCI_AWAIT_CONST_CMD_STATUS(state, &cmd_gap_start_passive_scan);
    status = aci_gap_start_general_conn_establish_proc_end();
    if (status == BLE_STATUS_SUCCESS) {
        pbdrv_bluetooth_is_observing = true;
    }
    PBIO_OS_ASYNC_END(ble_error_to_pbio_error(status));
}


pbio_error_t pbdrv_bluetooth_stop_observing_func(pbio_os_state_t *state, void *context) {
    PBIO_OS_ASYNC_BEGIN(state);

