pybricks/pybricks-micropython/lib/pbio/drv/bluetooth/bluetooth_stm32_bluenrg.c
    if (!pbdrv_bluetooth_is_observing) {
        return PBIO_SUCCESS;
    }

    HCI_AWAIT_CONST_CMD(state, &cmd_gap_terminate_general_proc);
    // tBleStatus status = aci_gap_terminate_gap_procedure_end();

    // if (status != BLE_STATUS_SUCCESS) {
    //     task->status = ble_error_to_pbio_error(status);
    //     PT_EXIT(pt);
    // }

    // TODO: wait for Evt_Blue_Gap_Procedure_Completed

    pbdrv_bluetooth_is_observing = false;

    PBIO_OS_ASYNC_END(PBIO_SUCCESS);
}

// overrides weak function in start_*.S
void DMA1_Channel4_5_IRQHandler(void) {
    // if CH4 transfer complete
    if (DMA1->ISR & DMA_ISR_TCIF4) {
        // clear interrupt
        DMA1->IFCR = DMA_IFCR_CTCIF4;
        // disable CH4
        DMA1_Channel4->CCR &= ~DMA_CCR_EN;

        // notify that SPI xfer is complete
        spi_xfer_complete = true;
        pbio_os_request_poll();
    }
}

// overrides weak function in startup_*.S
void EXTI2_3_IRQHandler(void) {
    spi_irq = !!(GPIOD->IDR & GPIO_IDR_2);

    // clear the interrupt
    EXTI->PR = EXTI_PR_PR2;

    pbio_os_request_poll();
}

static inline void spi_enable_cs(void) {
    pbdrv_gpio_out_low(&cs_gpio);
}

static inline void spi_disable_cs(void) {
    pbdrv_gpio_out_high(&cs_gpio);
}

// configures and starts an SPI xfer
static void spi_start_xfer(const uint8_t *tx_buf, uint8_t *rx_buf, uint8_t xfer_size) {
    // reset the xfer complete flag
    spi_xfer_complete = false;

    // hopefully this shouldn't actually block, but we can't disable SPI while
    // it is busy, so just in case...
    while (SPI2->SR & SPI_SR_BSY) {
    }

    // disable the SPI so we can configure it
    SPI2->CR1 &= ~SPI_CR1_SPE;

    // configure DMA
    DMA1_Channel5->CCR = 0;
    DMA1_Channel4->CCR = 0;
    DMA1_Channel5->CMAR = (uint32_t)tx_buf;
    DMA1_Channel5->CNDTR = xfer_size;
    DMA1_Channel4->CMAR = (uint32_t)rx_buf;
    DMA1_Channel4->CNDTR = xfer_size;
    // dummy bufs are only one byte, so don't enable memory increment for them
    DMA1_Channel4->CCR = (rx_buf == dummy_read_buf ? 0 : DMA_CCR_MINC) | DMA_CCR_TCIE | DMA_CCR_EN;
    DMA1_Channel5->CCR = (tx_buf == dummy_write_buf ? 0 : DMA_CCR_MINC) | DMA_CCR_DIR | DMA_CCR_EN;

    // enable SPI to start the xfer
    SPI2->CR1 |= SPI_CR1_SPE;
}

// gets the available tx and rx buffer sizes returned in the BlueNRG SPI header
// returns true if the header is valid, otherwise false
static bool get_bluenrg_buf_size(uint8_t *wbuf, uint8_t *rbuf) {
    if (header_rx[0] != BLUENRG_READY) {
        return false;
    }

    *wbuf = header_rx[1];
    *rbuf = header_rx[3];

    return true;
}

// assigned to one of RESET_* from bluenrg_hal_aci.h
static uint8_t reset_reason;

// Device information service.
static const uint8_t device_information_service_uuid[] = { PBIO_UINT16_LE(PBIO_GATT_DEVICE_INFO_SERVICE_UUID) };
static const uint8_t firmware_version_char_uuid[] = { PBIO_UINT16_LE(PBIO_GATT_FIRMWARE_VERSION_CHAR_UUID) };
static const uint8_t software_version_char_uuid[] = { PBIO_UINT16_LE(PBIO_GATT_SOFTWARE_VERSION_CHAR_UUID) };
static const uint8_t pnp_id_char_uuid[] = { PBIO_UINT16_LE(PBIO_GATT_PNP_ID_CHAR_UUID) };

// Pybricks service: c5f50001-8280-46da-89f4-6d8051e4aeef
static const uint8_t pybricks_service_uuid[] = {
    0xef, 0xae, 0xe4, 0x51, 0x80, 0x6d, 0xf4, 0x89,
    0xda, 0x46, 0x80, 0x82, 0x01, 0x00, 0xf5, 0xc5
};

// c5f50002-8280-46da-89f4-6d8051e4aeef
static const uint8_t pybricks_command_event_char_uuid[] = {
    0xef, 0xae, 0xe4, 0x51, 0x80, 0x6d, 0xf4, 0x89,
    0xda, 0x46, 0x80, 0x82, 0x02, 0x00, 0xf5, 0xc5
};

// c5f50003-8280-46da-89f4-6d8051e4aeef
static const uint8_t pybricks_hub_capabilities_char_uuid[] = {
    0xef, 0xae, 0xe4, 0x51, 0x80, 0x6d, 0xf4, 0x89,
    0xda, 0x46, 0x80, 0x82, 0x03, 0x00, 0xf5, 0xc5
};

static const uint8_t pnp_id[] = {
    PBIO_PYBRICKS_PNP_ID_INIT(PBDRV_CONFIG_HUB_KIND, PBDRV_CONFIG_HUB_VARIANT),
};

// Characteristic values that are not known at compile time. Filled in before
// the table below is walked.
static uint8_t hub_capabilities[PBIO_PYBRICKS_HUB_CAPABILITIES_VALUE_SIZE];

/**
 * One service or characteristic to add to the GATT database.
 *
 * Attributes are added in table order and each characteristic belongs to the
 * service that precedes it, mirroring how the controller builds the database.
 */
typedef struct {
    /** Service or characteristic UUID. */
    const uint8_t *uuid;
    /** Where to save the handle assigned by the controller, or NULL. */
    uint16_t *handle;
    /** Initial characteristic value, or NULL to leave the value unset. */
    const void *value;
    /** Either UUID_TYPE_16 or UUID_TYPE_128. */
    uint8_t uuid_type;
    /** Attribute records to reserve for a service, or 0 for a characteristic. */
    uint8_t max_attr_records;
    /** Characteristic value size, which is also the size of @p value. */
    uint8_t value_len;
    /** Characteristic properties (CHAR_PROP_*). */
    uint8_t properties;
    /** Which characteristic events to raise (GATT_*). */
    uint8_t gatt_evt_mask;
    /** Either CHAR_VALUE_LEN_CONSTANT or CHAR_VALUE_LEN_VARIABLE. */
    uint8_t is_variable;
} gatt_attr_t;

static const gatt_attr_t gatt_attrs[] = {
    {
        .uuid_type = UUID_TYPE_16,
        .uuid = device_information_service_uuid,
        .max_attr_records = 7,
    },
    {
        .uuid_type = UUID_TYPE_16,
        .uuid = firmware_version_char_uuid,
        .value_len = sizeof(PBIO_VERSION_STR) - 1,
        .properties = CHAR_PROP_READ,
        .gatt_evt_mask = GATT_DONT_NOTIFY_EVENTS,
        .is_variable = CHAR_VALUE_LEN_CONSTANT,
        .value = PBIO_VERSION_STR,
    },
    {
        .uuid_type = UUID_TYPE_16,
        .uuid = software_version_char_uuid,
        .value_len = sizeof(PBIO_PROTOCOL_VERSION_STR) - 1,
        .properties = CHAR_PROP_READ,
        .gatt_evt_mask = GATT_DONT_NOTIFY_EVENTS,
        .is_variable = CHAR_VALUE_LEN_CONSTANT,
        .value = PBIO_PROTOCOL_VERSION_STR,
    },
    {
        .uuid_type = UUID_TYPE_16,
        .uuid = pnp_id_char_uuid,
        .value_len = PBIO_PYBRICKS_PNP_ID_SIZE,
        .properties = CHAR_PROP_READ,
        .gatt_evt_mask = GATT_DONT_NOTIFY_EVENTS,
        .is_variable = CHAR_VALUE_LEN_CONSTANT,
        .value = pnp_id,
    },
    {
        .uuid_type = UUID_TYPE_128,
        .uuid = pybricks_service_uuid,
        .max_attr_records = 6,
        .handle = &pybricks_service_handle,
    },
    {
        .uuid_type = UUID_TYPE_128,
        .uuid = pybricks_command_event_char_uuid,
        .value_len = ATT_MTU - 3,
        .properties = CHAR_PROP_WRITE | CHAR_PROP_NOTIFY,
        .gatt_evt_mask = GATT_NOTIFY_WRITE_REQ_AND_WAIT_FOR_APPL_RESP,
        .is_variable = CHAR_VALUE_LEN_VARIABLE,
        .handle = &pybricks_command_event_char_handle,
    },
    {
        .uuid_type = UUID_TYPE_128,
        .uuid = pybricks_hub_capabilities_char_uuid,
        .value_len = PBIO_PYBRICKS_HUB_CAPABILITIES_VALUE_SIZE,
        .properties = CHAR_PROP_READ,
        .gatt_evt_mask = GATT_DONT_NOTIFY_EVENTS,
        .is_variable = CHAR_VALUE_LEN_CONSTANT,
        .handle = &pybricks_hub_capabilities_char_handle,
        .value = hub_capabilities,
    },
};

/**
 * Adds all services and characteristics in ::gatt_attrs to the GATT database.
 */
static pbio_error_t init_gatt_services(pbio_os_state_t *state, void *context) {
    static const gatt_attr_t *attr;
    static uint16_t service_handle, char_handle;
    static uint8_t idx;

    PBIO_OS_ASYNC_BEGIN(state);

    pbsys_host_get_hub_capabilities(hub_capabilities, PBSYS_HOST_TRANSPORT_TYPE_BLUETOOTH);

    for (idx = 0; idx < PBIO_ARRAY_SIZE(gatt_attrs); idx++) {

        attr = &gatt_attrs[idx];

        if (attr->max_attr_records) {
            aci_gatt_add_serv_begin(attr->uuid_type, attr->uuid, PRIMARY_SERVICE, attr->max_attr_records);
        } else {
            aci_gatt_add_char_begin(service_handle, attr->uuid_type, attr->uuid,
                attr->value_len, attr->properties, ATTR_PERMISSION_NONE,
                attr->gatt_evt_mask, MIN_ENCRY_KEY_SIZE, attr->is_variable);
        }
        PBIO_OS_AWAIT_UNTIL(state, hci_command_complete);
        if (attr->max_attr_records) {
            aci_gatt_add_serv_end(&service_handle);
            if (attr->handle) {
                *attr->handle = service_handle;
            }
        } else {
            aci_gatt_add_char_end(&char_handle);
            if (attr->handle) {
                *attr->handle = char_handle;
            }
        }

        if (!attr->value) {
            continue;
        }

        aci_gatt_update_char_value_begin(service_handle, char_handle, 0, attr->value_len, attr->value);
        PBIO_OS_AWAIT_UNTIL(state, hci_command_complete);
        // aci_gatt_update_char_value_end();
    }

