pybricks/pybricks-micropython/lib/pbio/drv/bluetooth/bluetooth_stm32_bluenrg.c
    PBIO_OS_ASYNC_END(PBIO_SUCCESS);
}

// processes an event received from the Bluetooth chip
static void handle_event(hci_event_pckt *event) {

    pbio_bluetooth_peripheral_t *peri = &peripheral_singleton;

    switch (event->evt) {
        case EVT_DISCONN_COMPLETE: {
            evt_disconn_complete *evt = (evt_disconn_complete *)event->data;
            if (evt->handle == conn_handle) {
                conn_handle = 0;
                pybricks_notify_en = false;
                pbio_bluetooth_host_connection_changed();
            } else if (evt->handle == peri->con_handle) {
                peri->con_handle = 0;
            }
        }
        break;

        case EVT_CMD_COMPLETE:
            hci_command_complete = true;
            break;

        case EVT_CMD_STATUS:
            hci_command_status = true;
            break;

        case EVT_LE_META_EVENT: {
            evt_le_meta_event *evt = (evt_le_meta_event *)event->data;
            switch (evt->subevent) {
                case EVT_LE_CONN_COMPLETE: {
                    evt_le_connection_complete *subevt = (evt_le_connection_complete *)evt->data;
                    if (subevt->role == GAP_PERIPHERAL_ROLE) {
                        conn_handle = subevt->handle;
                        pbdrv_bluetooth_advertising_state = PBDRV_BLUETOOTH_ADVERTISING_STATE_NONE;
                    } else {
                        peri->con_handle = subevt->handle;
                    }
                }
                break;

                case EVT_LE_ADVERTISING_REPORT: {
                    // NB: assumes num_reports is always 1
                    le_advertising_info *subevt = (void *)(evt->data + 1);

                    if (pbdrv_bluetooth_observe_callback) {
                        pbdrv_bluetooth_observe_callback(subevt->evt_type, subevt->data_RSSI,
                            subevt->data_length, subevt->data_RSSI[subevt->data_length]);
                    }

                    advertising_data_received = true;
                }
                break;
            }
        }
        break;

        case EVT_VENDOR: {
            evt_blue_aci *evt = (evt_blue_aci *)event->data;
            switch (evt->ecode) {
                case EVT_BLUE_HAL_INITIALIZED: {
                    evt_hal_initialized *subevt = (evt_hal_initialized *)evt->data;
                    reset_reason = subevt->reason_code;
                }
                break;

                case EVT_BLUE_GATT_ATTRIBUTE_MODIFIED: {
                    evt_gatt_attr_modified *subevt = (evt_gatt_attr_modified *)evt->data;
                    if (subevt->attr_handle == pybricks_command_event_char_handle + 2) {
                        pybricks_notify_en = subevt->att_data[0];
                        pbio_bluetooth_host_connection_changed();
                    }
                }
                break;

                case EVT_BLUE_GATT_NOTIFICATION: {
                    evt_gatt_attr_notification *subevt = (void *)evt->data;
                    if (peri->config.notification_handler) {
                        peri->config.notification_handler(peri->user, subevt->attr_value, subevt->event_data_length - 2);
                    }
                }
                break;

                case EVT_BLUE_GATT_WRITE_PERMIT_REQ: {
                    evt_gatt_write_permit_req *subevt = (evt_gatt_write_permit_req *)evt->data;
                    pbio_pybricks_error_t err = PBIO_PYBRICKS_ERROR_INVALID_HANDLE;

                    if (subevt->attr_handle == pybricks_command_event_char_handle + 1) {
                        err = pbio_bluetooth_receive_handler(subevt->data, subevt->data_length);
                    }

                    aci_gatt_write_response_begin(subevt->conn_handle, subevt->attr_handle, !!err, err, subevt->data_length, subevt->data);
                }
                break;

                case EVT_BLUE_GATT_TX_POOL_AVAILABLE: {
                    // REVISIT: We might need to look at the event args for
                    // connection handle if we need to handle this in multiple
                    // places, e.g. for notifications and write without response.
                    tx_pool_available = true;
                }
                break;
            }
        }
        break;
    }

    pbio_os_request_poll();
}

// read message from BlueNRG chip
static pbio_error_t spi_read(pbio_os_state_t *state) {
    hci_uart_pckt *pckt = (hci_uart_pckt *)read_buf;
    uint8_t wbuf, rbuf;

    PBIO_OS_ASYNC_BEGIN(state);

retry:
    if (!spi_irq) {
        // if SPI_IRQ went away, reading will fail, so don't try
        return PBIO_ERROR_IO;
    }

    spi_enable_cs();

    // send the read header
    spi_start_xfer(read_header_tx, header_rx, BLUENRG_HEADER_SIZE);
    PBIO_OS_AWAIT_UNTIL(state, spi_xfer_complete);

    // keep retrying until the chip is ready to read
    if (!get_bluenrg_buf_size(&wbuf, &rbuf) || rbuf == 0) {
        // TODO: should probably have a timeout (and reset the chip after that?)
        spi_disable_cs();
        goto retry;
    }

    // read the message
    spi_start_xfer(dummy_write_buf, read_buf, rbuf);
    PBIO_OS_AWAIT_UNTIL(state, spi_xfer_complete);

    spi_disable_cs();

    // handle the received data (note: can't use switch statement here because
    // we are using protothreads)
    if (pckt->type == HCI_EVENT_PKT) {
        handle_event((hci_event_pckt *)pckt->data);
    }

    PBIO_OS_ASYNC_END(PBIO_SUCCESS);
}

// write message to BlueNRG chip
static pbio_error_t spi_write(pbio_os_state_t *state) {
    uint8_t wbuf, rbuf;

    PBIO_OS_ASYNC_BEGIN(state);

retry:
    spi_enable_cs();

    // send the write header
    spi_start_xfer(write_header_tx, header_rx, BLUENRG_HEADER_SIZE);
    PBIO_OS_AWAIT_UNTIL(state, spi_xfer_complete);

    // keep retrying until the chip is ready to write
    if (!get_bluenrg_buf_size(&wbuf, &rbuf) || wbuf < write_xfer_size) {
        // TODO: should probably have a timeout (and reset the chip after that?)
        spi_disable_cs();
        goto retry;
    }

    // write the message
    spi_start_xfer(write_buf, dummy_read_buf, write_xfer_size);
    PBIO_OS_AWAIT_UNTIL(state, spi_xfer_complete);

    spi_disable_cs();

    // set to 0 to indicate that xfer is complete
    write_xfer_size = 0;

