pybricks/pybricks-micropython/lib/pbio/drv/bluetooth/bluetooth_stm32_bluenrg.c
    PBIO_OS_ASYNC_END(PBIO_SUCCESS);
}

// implements function for BlueNRG library
void hci_send_req(struct hci_request *r) {
    hci_uart_pckt *pckt = (hci_uart_pckt *)write_buf;
    hci_command_hdr *hdr = (hci_command_hdr *)pckt->data;
    void *cmd = &write_buf[HCI_HDR_SIZE + HCI_COMMAND_HDR_SIZE];

    pckt->type = HCI_COMMAND_PKT;
    hdr->opcode = r->opcode;
    hdr->plen = r->clen;
    memcpy(cmd, r->cparam, r->clen);
    write_xfer_size = HCI_HDR_SIZE + HCI_COMMAND_HDR_SIZE + r->clen;

    hci_command_complete = hci_command_status = false;
}

// implements function for BlueNRG library
void hci_recv_resp(struct hci_response *r) {
    int offset = HCI_HDR_SIZE + HCI_EVENT_HDR_SIZE;

    assert(read_buf[0] == HCI_EVENT_PKT);

    // *_end() functions for command complete skip the evt_cmd_complete struct
    // when unpacking the event data
    if (read_buf[1] == EVT_CMD_COMPLETE) {
        offset += EVT_CMD_COMPLETE_SIZE;
    }

    memcpy(r->rparam, &read_buf[offset], r->rlen);
}

// Equivalent of aci_hal_write_config_data_begin(CONFIG_DATA_MODE_OFFSET,
// CONFIG_DATA_MODE_LEN, &mode) with mode 4. Mode 4 supports advertising and
// scanning at the same time, which is needed to broadcast and observe at
// once, and has enough RAM for all of the current services/characteristics.
static const hci_const_cmd_t cmd_hal_write_config_mode = {
    .opcode = cmd_opcode_pack(OGF_VENDOR_CMD, OCF_HAL_WRITE_CONFIG_DATA),
    .plen = 2 + CONFIG_DATA_MODE_LEN,
    .params = { CONFIG_DATA_MODE_OFFSET, CONFIG_DATA_MODE_LEN, 4 },
};

// Equivalent of aci_hal_set_tx_power_level_begin(1, 5).
// 1.4 dBm - same as LEGO firmware.
static const hci_const_cmd_t cmd_hal_set_tx_power = {
    .opcode = cmd_opcode_pack(OGF_VENDOR_CMD, OCF_HAL_SET_TX_POWER_LEVEL),
    .plen = 2,
    .params = { 1, 5 },
};

// Equivalent of hci_le_read_local_version_begin().
static const hci_const_cmd_t cmd_read_local_version = {
    .opcode = cmd_opcode_pack(OGF_INFO_PARAM, OCF_READ_LOCAL_VERSION),
    .plen = 0,
};

// Equivalent of aci_gatt_init_begin().
static const hci_const_cmd_t cmd_gatt_init = {
    .opcode = cmd_opcode_pack(OGF_VENDOR_CMD, OCF_GATT_INIT),
    .plen = 0,
};

// Equivalent of aci_gap_init_begin(GAP_PERIPHERAL_ROLE | GAP_CENTRAL_ROLE,
// PRIVACY_DISABLED, sizeof(pbdrv_bluetooth_hub_name)).
static const hci_const_cmd_t cmd_gap_init = {
    .opcode = cmd_opcode_pack(OGF_VENDOR_CMD, OCF_GAP_INIT),
    .plen = 3,
    .params = { GAP_PERIPHERAL_ROLE | GAP_CENTRAL_ROLE, PRIVACY_DISABLED, sizeof(pbdrv_bluetooth_hub_name) },
};

// Initializes the Bluetooth chip
// this function is largely inspired by the LEGO bootloader
static pbio_error_t hci_init(pbio_os_state_t *state, void *context) {
    static uint16_t gap_service_handle, gap_dev_name_char_handle, gap_appearance_char_handle;

    PBIO_OS_ASYNC_BEGIN(state);

    // set the mode

    HCI_AWAIT_CONST_CMD(state, &cmd_hal_write_config_mode);
    // aci_hal_write_config_data_end();

    // set the Bluetooth address

    {
        // has to be in little-endian format, but stored in big-endian in flash
        uint8_t bd_addr[6];
        bd_addr[0] = FLASH_BD_ADDR[5];
        bd_addr[1] = FLASH_BD_ADDR[4];
        bd_addr[2] = FLASH_BD_ADDR[3];
        bd_addr[3] = FLASH_BD_ADDR[2];
        bd_addr[4] = FLASH_BD_ADDR[1];
        bd_addr[5] = FLASH_BD_ADDR[0];
        aci_hal_write_config_data_begin(CONFIG_DATA_PUBADDR_OFFSET, CONFIG_DATA_PUBADDR_LEN, bd_addr);
    }
    PBIO_OS_AWAIT_UNTIL(state, hci_command_complete);
    // aci_hal_write_config_data_end();

    // set Tx power level

    HCI_AWAIT_CONST_CMD(state, &cmd_hal_set_tx_power);
    // aci_hal_set_tx_power_level_end();

    HCI_AWAIT_CONST_CMD(state, &cmd_read_local_version);
    {
        uint8_t hci_version;
        uint16_t hci_revision;
        uint8_t lmp_pal_version;
        uint16_t manufacturer_name;
        uint16_t lmp_pal_subversion;
        hci_le_read_local_version_end(&hci_version, &hci_revision, &lmp_pal_version, &manufacturer_name, &lmp_pal_subversion);

        // seems like STM or LEGO hacked this command to get firmware version
        pbdrv_bluetooth_fw_version[0] = '0' + hci_revision;
        pbdrv_bluetooth_fw_version[1] = '.';
        pbdrv_bluetooth_fw_version[2] = '0' + (lmp_pal_subversion >> 4);
        pbdrv_bluetooth_fw_version[3] = '`' + (lmp_pal_subversion & 0xf);
        // LEGO firmware replaces (lmp_pal_subversion & 0xf) == 0 with "dev" but
        // it seems highly unlikely that we would ever see that
        pbdrv_bluetooth_fw_version[4] = '\0';
    }

    // init GATT layer

    HCI_AWAIT_CONST_CMD(state, &cmd_gatt_init);
    // aci_gatt_init_end();

    // init GAP layer

    HCI_AWAIT_CONST_CMD(state, &cmd_gap_init);
    aci_gap_init_end(&gap_service_handle, &gap_dev_name_char_handle, &gap_appearance_char_handle);

    // set the device name

    aci_gatt_update_char_value_begin(gap_service_handle, gap_dev_name_char_handle,
        0, strlen(pbdrv_bluetooth_hub_name), pbdrv_bluetooth_hub_name);
    PBIO_OS_AWAIT_UNTIL(state, hci_command_complete);
    // aci_gatt_update_char_value_end();

    // The chip always uses the same random address, so we set our own,
    // derived from the chip address and firmware version. It persists across
    // reboots but changes on firmware update. This must be called after
    // aci_gap_init to take effect.
    PBIO_OS_AWAIT_WHILE(state, write_xfer_size);
    {
        uint8_t addr[6];
        pbdrv_bluetooth_derive_static_address(addr, FLASH_BD_ADDR);
        hci_le_set_random_address_begin(addr);
    }
    PBIO_OS_AWAIT_UNTIL(state, hci_command_complete);
    // hci_le_set_random_address_end();

    PBIO_OS_ASYNC_END(PBIO_SUCCESS);
}

void pbdrv_bluetooth_controller_reset_hard(void) {
    pybricks_notify_en = false;
    conn_handle = peripheral_singleton.con_handle = 0;
    spi_disable_cs();
    bluetooth_reset(true);
}

pbio_error_t pbdrv_bluetooth_controller_reset(pbio_os_state_t *state, pbio_os_timer_t *timer) {
    PBIO_OS_ASYNC_BEGIN(state);
    pbdrv_bluetooth_controller_reset_hard();
    PBIO_OS_AWAIT_MS(state, timer, 50);
    PBIO_OS_ASYNC_END(PBIO_SUCCESS);
}

pbio_error_t pbdrv_bluetooth_controller_initialize(pbio_os_state_t *state, pbio_os_timer_t *timer) {

    static pbio_os_state_t sub;
    static size_t idx;

    PBIO_OS_ASYNC_BEGIN(state);

    // take Bluetooth chip out of reset
    bluetooth_reset(false);

    // wait for the Bluetooth chip to send the reset reason event so we know
    // that it is ready to receive commands
    reset_reason = 0;
    PBIO_OS_AWAIT_UNTIL(state, reset_reason);

    // Init hci, gatt, gap, and services.
    static const pbio_os_process_func_t init_funcs[] = {
        hci_init,
        init_gatt_services,
    };
    for (idx = 0; idx < PBIO_ARRAY_SIZE(init_funcs); idx++) {
        PBIO_OS_AWAIT(state, &sub, init_funcs[idx](&sub, NULL));
    }

