pybricks/pybricks-micropython/lib/pbio/drv/bluetooth/bluetooth_stm32_bluenrg.c
    PBIO_OS_ASYNC_END(PBIO_SUCCESS);
}

pbio_error_t pbdrv_bluetooth_disconnect_all(pbio_os_state_t *state) {

    static pbio_os_state_t sub;

    PBIO_OS_ASYNC_BEGIN(state);

    PBIO_OS_AWAIT(state, &sub, pbdrv_bluetooth_peripheral_disconnect_func(&sub, &peripheral_singleton));

    // Disconnect gracefully if connected to host.
    if (conn_handle) {
        aci_gap_terminate_begin(conn_handle, HCI_OE_USER_ENDED_CONNECTION);
        PBIO_OS_AWAIT_UNTIL(state, hci_command_status);
        aci_gap_terminate_end();
        PBIO_OS_AWAIT_UNTIL(state, conn_handle == 0);
    }

    PBIO_OS_ASYNC_END(PBIO_SUCCESS);
}

static pbio_os_process_t pbdrv_bluetooth_spi_process;

static pbio_error_t pbdrv_bluetooth_spi_process_thread(pbio_os_state_t *state, void *context) {

    static pbio_os_state_t main_thread_state;
    static pbio_os_state_t sub;

    PBIO_OS_ASYNC_BEGIN(state);

    PBIO_OS_ASYNC_RESET(&main_thread_state);

    for (;;) {
        PBIO_OS_AWAIT_UNTIL(state, {
            // Iterate the main Bluetooth thread once when some data is
            // available or new data can be sent. It is not iterated while a
            // write is pending, so the threads it drives never need to await
            // the transport becoming free before sending a command.
            if (!write_xfer_size) {
                pbio_error_t err = pbdrv_bluetooth_process_thread(&main_thread_state, NULL);

                // Exit this spi process once the high level Bluetooth process completes.
                if (err != PBIO_ERROR_AGAIN) {
                    return err;
                }
            }

            // - spi_irq is set by the interrupt handler when there is new
            //   data to be processed, which also polls this process in order
            //   to push PROCESS_WAIT_UNTIL to evaluate this condition again.
            // - write_xfer_size is set when main thread
            //   driven above above wants to send something. This doesn't poll
            //   the process because we are already here.
            spi_irq || write_xfer_size;
        });

        // if there is a pending read message
        if (spi_irq) {
            PBIO_OS_AWAIT(state, &sub, spi_read(&sub));
        }
        // if there is a pending write message
        else if (write_xfer_size) {
            PBIO_OS_AWAIT(state, &sub, spi_write(&sub));
        }
    }

    // Unreachable.
    PBIO_OS_ASYNC_END(PBIO_ERROR_FAILED);
}

void pbdrv_bluetooth_init(void) {
    bluetooth_reset(true);
    spi_init();
    pbio_os_process_start(&pbdrv_bluetooth_spi_process, pbdrv_bluetooth_spi_process_thread, NULL);
}

#endif // PBDRV_CONFIG_BLUETOOTH_STM32_BLUENRG
